cleanroom/system/controlDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}

application     buoyantFoam;
startFrom       startTime;
startTime       0;
stopAt          endTime;
endTime         200;
deltaT          1;
adjustTimeStep  on;
maxCo           0.9;
writeControl    timeStep;
writeInterval   1;
purgeWrite      0;
writeFormat     ascii;
writePrecision  6;
writeCompression off;
timeFormat      general;
timePrecision   6;
runTimeModifiable on;

functions
{
    #includeFunc residuals(U,p_rgh,h,k,epsilon);
    #includeFunc cellMinMag(T,writeLocation=yes);
    #includeFunc cellMaxMag(T,writeLocation=yes);
}