cleanroom/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      blockMeshDict;
}
vertices
(
  (-4.77142296 2.6422610399999997 -1.12105856)
  (1.42857696 2.6422610399999997 -1.12105856)
  (1.42857696 10.124117960000001 -1.12105856)
  (-4.77142296 10.124117960000001 -1.12105856)
  (-4.77142296 2.6422610399999997 3.6789409600000003)
  (1.42857696 2.6422610399999997 3.6789409600000003)
  (1.42857696 10.124117960000001 3.6789409600000003)
  (-4.77142296 10.124117960000001 3.6789409600000003)
);
blocks
(
  hex (0 1 2 3 4 5 6 7) (23 27 18) simpleGrading (1 1 1)
);
defaultPatch
{
  type patch;
}
boundary ();
