cleanroom/system/snappyHexMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      snappyHexMeshDict;
}
castellatedMesh true;
snap            true;
addLayers       true;
geometry
{
  ceilling_walls.stl
  {
    type triSurfaceMesh;
    name ceilling_walls;
    regions
    {
      ceilling_walls
      {
        name ceilling_walls;
      }
    }
  }
  damper.stl
  {
    type triSurfaceMesh;
    name damper;
    regions
    {
      damper
      {
        name damper;
      }
    }
  }
  duct.stl
  {
    type triSurfaceMesh;
    name duct;
    regions
    {
      duct
      {
        name duct;
      }
    }
  }
  floor.stl
  {
    type triSurfaceMesh;
    name floor;
    regions
    {
      floor
      {
        name floor;
      }
    }
  }
  obj1.stl
  {
    type triSurfaceMesh;
    name obj1;
    regions
    {
      obj1
      {
        name obj1;
      }
    }
  }
  obj2.stl
  {
    type triSurfaceMesh;
    name obj2;
    regions
    {
      obj2
      {
        name obj2;
      }
    }
  }
  steel_partition.stl
  {
    type triSurfaceMesh;
    name steel_partition;
    regions
    {
      steel_partition
      {
        name steel_partition;
      }
    }
  }
  vinyl_sheet.stl
  {
    type triSurfaceMesh;
    name vinyl_sheet;
    regions
    {
      vinyl_sheet
      {
        name vinyl_sheet;
      }
    }
  }
  window.stl
  {
    type triSurfaceMesh;
    name window;
    regions
    {
      window
      {
        name window;
      }
    }
  }
}
castellatedMeshControls
{
  features (
    {
      file "ceilling_walls.eMesh";
      level 1;
    }
    {
      file "damper.eMesh";
      level 1;
    }
    {
      file "duct.eMesh";
      level 1;
    }
    {
      file "floor.eMesh";
      level 1;
    }
    {
      file "obj1.eMesh";
      level 1;
    }
    {
      file "obj2.eMesh";
      level 1;
    }
    {
      file "steel_partition.eMesh";
      level 1;
    }
    {
      file "vinyl_sheet.eMesh";
      level 1;
    }
    {
      file "window.eMesh";
      level 1;
    }
  );
  refinementSurfaces
  {
    ceilling_walls
    {
      level (0 0);
      regions
      {
        ceilling_walls
        {
          level (0 0);
          patchInfo
          {
            type wall;
          }
        }
      }
    }
    damper
    {
      level (0 0);
      regions
      {
        damper
        {
          level (0 0);
          patchInfo
          {
            type patch;
          }
        }
      }
    }
    duct
    {
      level (0 0);
      regions
      {
        duct
        {
          level (0 0);
          patchInfo
          {
            type patch;
          }
        }
      }
    }
    floor
    {
      level (0 0);
      regions
      {
        floor
        {
          level (0 0);
          patchInfo
          {
            type wall;
          }
        }
      }
    }
    obj1
    {
      level (0 0);
      regions
      {
        obj1
        {
          level (0 0);
          patchInfo
          {
            type wall;
          }
        }
      }
    }
    obj2
    {
      level (0 0);
      regions
      {
        obj2
        {
          level (0 0);
          patchInfo
          {
            type wall;
          }
        }
      }
    }
    steel_partition
    {
      level (0 0);
      regions
      {
        steel_partition
        {
          level (0 0);
          patchInfo
          {
            type wall;
          }
        }
      }
    }
    vinyl_sheet
    {
      level (0 0);
      regions
      {
        vinyl_sheet
        {
          level (0 0);
          patchInfo
          {
            type wall;
          }
        }
      }
    }
    window
    {
      level (0 0);
      regions
      {
        window
        {
          level (0 0);
          patchInfo
          {
            type wall;
          }
        }
      }
    }
  }
  refinementRegions {}
  locationInMesh (-1.6714229999999999 6.3831895 1.2789412000000002);
  maxLocalCells 100000000;
  maxGlobalCells 100000000;
  minRefinementCells 1;
  nCellsBetweenLevels 3;
  resolveFeatureAngle 30;
  allowFreeStandingZoneFaces false;
}
snapControls
{
  nSolveIter 30;
  nSmoothPatch 3;
  tolerance 4.0;
  nRelaxIter 5;
  nFeatureSnapIter 10;
}
addLayersControls
{
  layers
  {
  }
  relativeSizes true;
  expansionRatio 1.0;
  finalLayerThickness 0.3;
  minThickness 0.03;
  nGrow 1;
  featureAngle 60;
  nRelaxIter 5;
  nSmoothSurfaceNormals 1;
  nSmoothNormals 3;
  nSmoothThickness 10;
  maxFaceThicknessRatio 0.5;
  maxThicknessToMedialRatio 0.3;
  minMedianAxisAngle 130;
  nBufferCellsNoExtrude 0;
  nLayerIter 50;
  nRelaxedIter 20;
}
meshQualityControls
{
  maxNonOrtho 65;
  maxBoundarySkewness 20;
  maxInternalSkewness 4;
  maxConcave 80;
  minFlatness 0.5;
  minVol 1.00E-13;
  minTetQuality -1e30;
  minArea -1;
  minTwist 0.05;
  minDeterminant 0.001;
  minFaceWeight 0.05;
  minVolRatio 0.01;
  minTriangleTwist -1;
  nSmoothScale 4;
  errorReduction 0.75;
  relaxed
  {
    maxNonOrtho 180;
  }
}
debug 0;
mergeTolerance 1e-5;
