cleanroom/constant/thermophysicalProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermophysicalProperties;
}
thermoType
{
    type heRhoThermo;
    mixture pureMixture;
    transport const;
    thermo hConst;
    equationOfState perfectGas;
    specie specie;
    energy sensibleEnthalpy;
}
mixture
{
    specie
    {
        nMoles 1;
        molWeight 28.9;
    }
    thermodynamics
    {
        Cp 1006;
        Hf 0;
    }
    transport
    {
        mu 1.73e-05;
        Pr 0.7221;
    }
}
