cleanroom/0/U
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    0;
    object      U;
}
dimensions [0 1 -1 0 0 0 0];
internalField uniform (0.0 0.0 0.0);
boundaryField
{
    ceilling_walls
    {
        type slip;
    }
    damper
    {
        type fixedValue;
        value uniform (0.0021 0 0);
    }
    floor
    {
        type slip;
    }
    obj1
    {
        type slip;
    }
    obj2
    {
        type slip;
    }
    steel_partition
    {
        type slip;
    }
    vinyl_sheet
    {
        type slip;
    }
    duct
    {
        type fixedValue;
        value uniform (-0.022 0 0);
    }
    window
    {
        type slip;
    }
    defaultFaces
    {
        type slip;
    }
}
