cleanroom/0/p_rgh
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    0;
    object      p_rgh;
}
dimensions [1 -1 -2 0 0 0 0];
internalField uniform 101325;
boundaryField
{
    ceilling_walls
    {
        type fixedFluxPressure;
        value uniform 101325;
    }
    damper
    {
        type fixedFluxPressure;
        value uniform 101325;
    }
    floor
    {
        type fixedFluxPressure;
        value uniform 101325;
    }
    obj1
    {
        type fixedFluxPressure;
        value uniform 101325;
    }
    obj2
    {
        type fixedFluxPressure;
        value uniform 101325;
    }
    steel_partition
    {
        type fixedFluxPressure;
        value uniform 101325;
    }
    vinyl_sheet
    {
        type fixedFluxPressure;
        value uniform 101325;
    }
    duct
    {
        type fixedFluxPressure;
        value uniform 101325;
    }
    window
    {
        type fixedFluxPressure;
        value uniform 101325;
    }
    defaultFaces
    {
        type fixedFluxPressure;
        value uniform 101325;
    }
}
