cleanroom/0/T
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    0;
    object      T;
}
dimensions [0 0 0 1 0 0 0];
internalField uniform 296.0;
boundaryField
{
    ceilling_walls
    {
        type wallHeatTransfer;
        Tinf uniform 295.0;
        alphaWall uniform 0.5;
        value uniform 296.0;
    }
    damper
    {
        type fixedValue;
        value uniform 292.0;
    }
    floor
    {
        type wallHeatTransfer;
        Tinf uniform 295.0;
        alphaWall uniform 3.1;
        value uniform 296.0;
    }
    obj1
    {
        type wallHeatTransfer;
        Tinf uniform 295.0;
        alphaWall uniform 4.4;
        value uniform 296.0;
    }
    obj2
    {
        type wallHeatTransfer;
        Tinf uniform 295.0;
        alphaWall uniform 4.4;
        value uniform 296.0;
    }
    steel_partition
    {
        type wallHeatTransfer;
        Tinf uniform 295.0;
        alphaWall uniform 3.0;
        value uniform 296.0;
    }
    vinyl_sheet
    {
        type wallHeatTransfer;
        Tinf uniform 295.0;
        alphaWall uniform 4.0;
        value uniform 296.0;
    }
    duct
    {
        type fixedValue;
        value uniform 292.0;
    }
    window
    {
        type wallHeatTransfer;
        Tinf uniform 295.0;
        alphaWall uniform 5.9;
        value uniform 296.0;
    }
    defaultFaces
    {
        type zeroGradient;
    }
}
