cleanroom/0/k
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    0;
    object      k;
}
dimensions [0 2 -2 0 0 0 0];
internalField uniform 0.001;
boundaryField
{
    ceilling_walls
    {
        type zeroGradient;
    }
    damper
    {
        type fixedValue;
        value uniform 0.001;
    }
    floor
    {
        type zeroGradient;
    }
    obj1
    {
        type zeroGradient;
    }
    obj2
    {
        type zeroGradient;
    }
    steel_partition
    {
        type zeroGradient;
    }
    vinyl_sheet
    {
        type zeroGradient;
    }
    duct
    {
        type fixedValue;
        value uniform 0.001;
    }
    window
    {
        type zeroGradient;
    }
    defaultFaces
    {
        type zeroGradient;
    }
}
