cleanroom/system/surfaceFeaturesDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      surfaceFeaturesDict;
}
surfaces
(
    "ceilling_walls.stl"
    "damper.stl"
    "duct.stl"
    "floor.stl"
    "obj1.stl"
    "obj2.stl"
    "steel_partition.stl"
    "vinyl_sheet.stl"
    "window.stl"
);
includedAngle 165.0
subsetFeatures
{
    nonManifoldEdges no;
    openEdges yes;
}
writeObj yes;
